'''
Дан текст (точно в код скопировать, не исправлять):

text = """
Допустим, наша цель — выяснить людей, места и все что угодно, связанные друг с другом в наших    документах. Иными словами, нам нужно построить социальную сеть, выполнив серию    преобразований, как показано на рис. 9.4. Начнем конструирование графа с применения   класса EntityExtractor, созданного в главе 7.

Затем добавим преобразователи, один   из которых отыскивает        пары связанных сущностей, а второй преобразует эти пары в граф."""
Нужно посчитать количество:

слов в нём;
предложений;
слов на русском языке;
слов на англ. языке;
чисел
заглавных букв
'''
